歡迎來到關卡 ：
"Git 的基礎 ：與暫存區域的互動"！

首先，讓我們快速的回顧一下
上一關中我們學到的知識

在上一關卡中我們使用了
"git --version" 和 "git init"
這兩個指令執行 Git 的功能

其中 "git init" 作為建立 Git 管理系統的基礎
是我們開始使用 Git 系統
需要輸入的第一個指令

在執行指令後生成的 ".git" 資料夾 
就是我們 Git 系統的核心

再來，我們介紹了 ".git" 資料夾的功用
並且提到了三個組成 Git 的重要區域

分別是：
"工作目錄" (Working directory)
"暫存區域" (Staging area)
"存儲庫" (Repository)
 
-------

而本次關卡中將要
更進一步的介紹 "暫存區域" 的功能
並透過幾個 Git 指令來與它做互動！

讓我們先來模擬本次的遊戲背景！

在完成模擬後
我們先來回顧 "暫存區域" 的作用吧

"暫存區域" 在 Git 系統當中
作為橋樑的角色

我們在 "工作目錄" 中修改檔案內容後
需要透過 Git 指令將檔案移動 "暫存區域" 中

而當我們確定好修改內容後
會透過另一個 Git 指令將檔案存入到 "存儲庫" 中

"存儲庫" 會把這些檔案組合成一次記錄
這樣就算是完成一次提交

但是，我們無法直接在 "檔案管理" 視窗中
看到 "暫存區域" 和 "存儲庫" 這兩個區域
必須要透過特定的 Git 指令來檢視它們

現在，讓我來告訴您如何開啟 "暫存區域" 吧
這次我們同樣要透過 "命令行" 來輸入指令

請您先打開 "命令行" 視窗吧！

