git init

指令介紹：
"git init" 作為建立 Git 管理系統的基礎
是我們開始學習 Git 指令的第一步！

透過這個指令，將會在 "命令行" 所在的資料夾路徑中
建立新的 Git 管理系統 ( ".git" 隱藏資料夾 )

如果沒有 Git 管理系統，您將沒有辦法使用大部分的 Git 指令！
所以在開始管理專案前，請一定要先執行 "git init" 指令！


指令格式與作用：
git init
透過這個指令來建立新的 Git 管理系統
建立成功後會新增 ".git" 隱藏資料夾到您指定的位置中

注意事項：

Tag
Git 基礎、

----------------------------

git

指令介紹：
"git" 作為輸入 Git 指令的基礎
您在輸入指令的過程中都需要在指令的第一欄位中輸入它
一般來說，我們會繼續在指令的第二欄位輸入其他指令 
(例如："init" - 建立 Git 管理系統，"add" - 將檔案移動到 "暫存區域")

但是我們可以使用
在現實使用 "git" 的機會
通常在於您不太清楚一些 Git 指令怎麼輸入、指令有什麼作用
而輸入 "git"